pinewool/app/models/shopping_cart.rb

INSERT INTO "orders" ("sub_total", "created_at", "updated_at", "token") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sub_total", "0.0"], ["created_at", "2019-07-11 10:13:08.383996"], ["updated_at", "2019-07-11 10:13:08.383996"], ["token", "84bb07a3ffe36461"]]
SELECT  "orders".* FROM "orders" WHERE "orders"."token" = $1 LIMIT $2  [["token", "84bb07a3ffe36461"], ["LIMIT", 1]]
---
  def order
    @order ||= Order.find_or_create_by(token: @token) do |order|

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
  def add_item(product_id:, quantity: 1)
    product = Product.find(product_id)